{
    "sam": {
        "name": "Samuel Emard-Thibault",
        "about": "Hi, my name is Sam, I'm from Ottawa and I'm completing my studies in Kingston, ON. I enjoy creating, optimizing, and maintaining web applications!",
        "about_short": "Hi, my name is Sam, I'm from Ottawa and I'm completing my studies in Kingston, ON.",
        "education": "Currently studying Computer Engineering at Queen's University in ON, Canada.",
        "work_experience": [
            {
                "name": "MLH Production Engineering Fellow",
                "tasks": [
                    {
                        "val": "Develop web applications as a team using GitHub best practices such as PRs, code reviews, and issues"
                    },
                    {
                        "val": "Deploy Flask web applications through a CentOS VPS"
                    },
                    {
                        "val": "Develop Bash scripts and commands to streamline deployment processes and manipulate data"
                    },
                    {
                        "val": "Write Python unit and integration tests and automate them for deployment."
                    },
                    {
                        "val": "Containerize applications using Docker and orchestrate the deployment of multiple containers using Docker Compose."
                    },
                    {
                        "val": "Implement reverse proxy to limit HTTP request rates to important API endpoints."
                    },
                    {
                        "val": "Automate tests and deployment by building a CI/CD pipeline using GitHub Actions."
                    },
                    {
                        "val": "Monitor and visualize system metrics by integrating Prometheus and Grafana."
                    }
                ]
            },
            {
                "name": "Computer Science Tutor",
                "tasks": [
                    {
                        "val": "Help High school-level students learn the fundamental concepts of the Java programming language"
                    },
                    {
                        "val": "Review documentation to ensure lesson plans cater to varying Java Platform releases"
                    }
                ]
            },
            {
                "name": "Queen's Racing Electrical Team Member",
                "tasks": [
                    {
                        "val": "Analyze PCB designs of electrical components using digital logic fundamentals"
                    },
                    {
                        "val": "Collaborate with sub-teams to deliver an efficient and powerful race car"
                    },
                    {
                        "val": "Analyse MatLab SimuLink models and repository documentation to develop torque vectoring tools"
                    }
                ]
            },
            {
                "name": "Software Developer Intern, CAC",
                "tasks": [
                    {
                        "val": "Currently working as part of a team of developers for the Queen's Centre for Advanced Computing to develop and deploy web/mobile applications for external clients"
                    },
                    {
                        "val": "Current stack includes Nextjs, React, Flutter, Django, Nodejs, and AWS."
                    }
                ]
            }
        ],
        "hobbies": "hobby auto racing, buildings computers, and cooking.",
        "social": [
            {
                "name": "LinkedIn",
                "val": "https://www.linkedin.com/in/samuelemardthibault/"
            },
            {
                "name": "GitHub",
                "val": "https://github.com/SamEThibault"
            },
            {
                "name": "Email",
                "val": "sam5thibault@gmail.com"
            }
        ],
        "current": [
            {
                "val": "I'm currently a Software Developer Intern at the Queen's Centre for Advanced Computing."
            },
            {
                "val": "I'm working on my Linux skills by building a CentOS server to serve a few web apps."
            },
            {
                "val": "I'm currently working on my Django, Nextjs and deployment skills throughout my professional endeavours!"
            },
            {
                "val": "I'm learning about CI/CD to automate testing and deployment processes using Docker, GH Actions, and some Bash scripts."
            }
        ],
        "projects": [
            {
                "name": "QHACKS Hackathon, 1st place HOTG Category - CookHack",
                "link": "https://github.com/SamEThibault/cook-hack",
                "desc": "CookHack, a React.Js web application which recommends recipes based on ingredients you have available, won 1st place for the Hammer of the Gods category by implementing their image recognition API to suggest ingredient names to users through their Webcam. I set up a Flask backend to handle MongoDB requests from the frontend before migrating to Firebase."
            },
            {
                "name": "Personal Project - MongoWheels",
                "link": "https://github.com/SamEThibault/mongo-wheels",
                "desc": "Spring Boot web application with a MongoDB database which allows users to access automobile data. I have been working on the database to efficiently store a large amount of data in a way that can easily be modeled by Java objects. This allows the team to implement the MVC design effectively where information is put into view using Thymeleaf."
            },
            {
                "name": "NewHacks 2021, 3rd place overall - NoteHack",
                "link": "https://github.com/SamEThibault/note-hack",
                "desc": "Note sharing application (NoteHack) developed in 24 hours with a team of 4 members earned 3rd place overall for the NewHacks 2021 hackathon. I contributed to the project using React.Js fundamentals."
            },
            {
                "name": "#HackTo 2022, 1st place overall - Minute Tutor",
                "link":"https://github.com/SamEThibault/minute-tutor",
                "desc": "Tutor matching web application Minute Tutor earned 1st place overall at the #HackTo hackathon hosted by Amazon. This React.js application resolves the issue of finding help for specific academic problems by finding available tutors to answer a student's question instantly over video chat. I worked on the Flask backend which interacted with a MySQL database to store student and tutor information. I also learned about Redux and utilized the fetch API to populate global React states."
            },
            {
                "name": "S:\\HA<KS 2022, 3rd place overall - MoneyHack",
                "link": "https://github.com/SamEThibault/shacks-2022",
                "desc": "Budgeting / Financial advice application (MoneyHack) developed in 24 hours with a team of 4 members earned 3rd place overall during the S:\\HA<KS 2022 hackathon. This React.js application parses through monthly account statements to provide personalized data and tips to help users improve their financial literacy. I worked on a Flask backend to handle the logic of the application, as well as a database to store and update user information."
            }
        ]
    }
}