{
    "sam": {
        "name": "Samuel Emard-Thibault",
        "about": "Hi, my name is Sam, I'm from Ottawa, and am completing my studies in Kingston, ON. I enjoy working on web applications and exploring emerging technologies such as React, Flask, and Spring Boot!",
        "about_short": "Hi, my name is Sam, I'm from Ottawa, and am completing my studies in Kingston, ON.",
        "education": "Rising junior studying Computer Engineering at Queen's University in ON, Canada.",
        "work_experience": [
            {
                "name": "MLH Production Engineering Fellow",
                "tasks": [
                    {
                        "val": "Develop web applications as a team using GitHub best practices such as PRs, code reviews, and issues"
                    },
                    {
                        "val": "Deploy Flask web applications through a CentOS VPS"
                    },
                    {
                        "val": "Develop Bash scripts and commands to streamline deployment processes and manipulate data"
                    }
                ]
            },
            {
                "name": "Computer Science Tutor",
                "tasks": [
                    {
                        "val": "Help High school-level students learn the fundamental concepts of the Java programming language"
                    },
                    {
                        "val": "Review documentation to ensure lesson plans cater to varying Java Platform releases"
                    }
                ]
            },
            {
                "name": "Queen's Racing Electrical Team Member",
                "tasks": [
                    {
                        "val": "Analyze PCB designs of electrical components using digital logic fundamentals"
                    },
                    {
                        "val": "Collaborate with sub-teams to deliver an efficient and powerful race car"
                    },
                    {
                        "val": "Analyse MatLab SimuLink models and repository documentation to develop torque vectoring tools"
                    }
                ]
            }
        ],
        "hobbies": "working on cars, buildings computers, and playing video games.",
        "social": [
            {
                "name": "LinkedIn",
                "val": "https://www.linkedin.com/in/samuelemardthibault/"
            },
            {
                "name": "GitHub",
                "val": "https://github.com/SamEThibault"
            },
            {
                "name": "Email",
                "val": "sam5thibault@gmail.com"
            }
        ],
        "current": [
            {
                "val": "I'm part of the Summer 2022 MLH Fellowship and have joined the Production Engineering track."
            },
            {
                "val": "I'm working on automating deployment processes using Bash/Python scripting and Linux fundamentals. "
            },
            {
                "val": "I'm currently working on my Flask, Spring, SQL and NoSQL skills with MySQL, Firestore, and MongoDB!"
            },
            {
                "val": "I'm learning Object Oriented Java to work on Spring web apps and command line tools."
            }
        ],
        "projects": [
            {
                "name": "Hackville 2022 - TimeSavior",
                "link": "https://github.com/SamEThibault/time-savior",
                "desc": "Spring Boot web application that suggests days to complete weekly tasks based on a user's schedule."
            },
            {
                "name": "QHACKS Hackathon, 1st place HOTG Category - CookHack",
                "link": "https://github.com/SamEThibault/cook-hack",
                "desc": "React.Js web application that suggests recipes to cook based on a user's available ingredients."
            },
            {
                "name": "Personal Project - MongoWheels",
                "link": "https://github.com/SamEThibault/mongo-wheels",
                "desc": "Spring Boot web application with a MongoDB database which allows users to access automobile data."
            },
            {
                "name": "NewHacks 2021, 3rd place overall - NoteHack",
                "link": "https://github.com/SamEThibault/note-hack",
                "desc": "Note-sharing application that allows students to share their electronic notes."
            }
        ]
    }
}